modulo_05/time_to_answer/app/controllers/admins_backoffice/admins_controller.rb

  def update
    @admin = Admin.find(params[:id])
    params_admin = params.require(:admin).permit(:email, :password, :password_confirmation)

    if @admin.update(params_admin)
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "admins" SET "email" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["email", "elvis@cole-emard.com"], ["encrypted_password", "$2a$12$Vb8gGU.8Q/i7PgrPvI4FHuoB2xkAB3V4vw/vrYSWC90gRzKJKVsQC"], ["updated_at", "2021-02-17 20:00:29.003623"], ["id", 3]]