modulo_05/time_to_answer/app/controllers/admins_backoffice/admins_controller.rb

SELECT  "admins".* FROM "admins" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "admins"
---
  def index
    @admins = Admin.all.page(params[:page])

INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @admin = Admin.new(params_admin)

    if @admin.save

UPDATE "admins" SET "email" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["email", "lowell@dicki.com"], ["updated_at", "2021-02-17 20:55:47.857637"], ["id", 2]]
---
  def update
    if @admin.update(params_admin)

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 12]]
---
  def destroy
    if @admin.destroy