modulo_05/time_to_answer/app/controllers/admins_backoffice/questions_controller.rb

  def index
    @questions = Question.all.order(:description).page(params[:page])
---
SELECT  "questions".* FROM "questions" ORDER BY "questions"."description" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "questions"

  def destroy
    if @question.destroy
---
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1311]]