modulo_05/time_to_answer/app/controllers/admins_backoffice/subjects_controller.rb

  def index
    @subjects = Subject.all.page(params[:page])
---
SELECT  "subjects".* FROM "subjects" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "subjects"

  def create
    @subject = Subject.new(params_subject)

    if @subject.save
---
INSERT INTO "subjects" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Oi"], ["created_at", "2021-02-18 00:40:33.915843"], ["updated_at", "2021-02-18 00:40:33.915843"]]

  def update
    if @subject.update(params_subject)
---
UPDATE "subjects" SET "description" = ?, "updated_at" = ? WHERE "subjects"."id" = ?  [["description", "Administração de Recursos Materiaisssss"], ["updated_at", "2021-02-18 00:40:20.677815"], ["id", 2]]

  def destroy
    if @subject.destroy
---
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 1]]