modulo_05/time_to_answer/app/controllers/admins_backoffice/subjects_controller.rb

SELECT  "subjects".* FROM "subjects" ORDER BY "subjects"."description" ASC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @subjects = Subject.all.order(:description).page(params[:page])